{
  "irVersion": "1.0",
  "project": "prism-intelligence",
  "repository": "https://github.com/grokify/prism-intelligence",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.9.0",
      "date": "2026-05-18",
      "highlights": [
        { "description": "DMAIC (Define, Measure, Analyze, Improve, Control) metrics framework for structured improvement cycles" },
        { "description": "prism-core integration for shared primitives across PRISM ecosystem" }
      ],
      "added": [
        { "description": "DMAIC package with Cycle type for structured improvement tracking", "commit": "e66d9a6" },
        { "description": "DMAIC phase constants: Define, Measure, Analyze, Improve, Control", "commit": "e66d9a6" },
        { "description": "DMAIC Pandoc and Marp rendering support via structureddocs", "commit": "e66d9a6" }
      ],
      "changed": [
        { "description": "Import Domain, Layer, Stage types from prism-core", "commit": "6b231de" },
        { "description": "Import MaturityLevel and TeamType from prism-core", "commit": "6b231de" },
        { "description": "Import TrendDirection from prism-core", "commit": "6b231de" },
        { "description": "Update MaturityLevelName test expectations for prism-core behavior", "commit": "46b5e19" }
      ],
      "dependencies": [
        { "description": "Add github.com/grokify/prism-core v0.1.0", "commit": "ad78714" },
        { "description": "Add github.com/grokify/structureddocs v0.1.0 for DMAIC rendering", "commit": "fd50960" },
        { "description": "Update github.com/grokify/prism-execution to v0.12.0", "commit": "6167cbf" }
      ],
      "documentation": [
        { "description": "Add v0.9.0 release notes documenting DMAIC and prism-core integration" }
      ]
    },
    {
      "version": "v0.8.0",
      "date": "2026-05-17",
      "highlights": [
        { "description": "Repository renamed from grokify/prism to grokify/prism-intelligence" },
        { "description": "Part of PRISM ecosystem consolidation with prism-capability and prism-execution" }
      ],
      "breaking": [
        { "description": "Go module path changed from github.com/grokify/prism to github.com/grokify/prism-intelligence", "commit": "1f520bd" }
      ],
      "changed": [
        { "description": "All import paths updated to github.com/grokify/prism-intelligence", "commit": "1f520bd" },
        { "description": "JSON Schema $id URLs updated to prism-intelligence", "commit": "e2fb90b" },
        { "description": "README badges and installation instructions updated", "commit": "3cd2863" }
      ],
      "documentation": [
        { "description": "Updated README with new repository URLs and installation commands", "commit": "3cd2863" }
      ],
      "dependencies": [
        { "description": "Update prism-execution to v0.11.0 (renamed from structured-plan)", "commit": "896d97d" }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-05-17",
      "highlights": [
        { "description": "Threshold Matrix XLSX sheet with M1-M5 threshold columns" },
        { "description": "SLI tags with kebab-case validation for multi-dimensional classification" },
        { "description": "NIST CSF category ordering: govern → identify → protect → detect → respond → recover" },
        { "description": "Dashboard bullet charts grouped by category with section headers" }
      ],
      "added": [
        { "description": "Threshold Matrix XLSX sheet showing SLIs with Category, Tags, Frameworks, and M1-M5 threshold columns" },
        { "description": "`Tags` field on SLI for multi-dimensional classification orthogonal to category" },
        { "description": "Tag validation: lowercase kebab-case, 1-32 characters, starts with letter" },
        { "description": "`ValidateTag()`, `NormalizeTags()`, `GetNormalizedTags()` functions for tag handling" },
        { "description": "Recommended tag constants: ai, shift-left, supply-chain, runtime-defense, vulnerability-management, incident-response" },
        { "description": "`Category` struct with ID, Name, Description, and SLIOrder for custom ordering" },
        { "description": "`Categories` array in Spec for custom category and SLI display order" },
        { "description": "`CategorySortWeight()` returns NIST CSF canonical order with common variations" },
        { "description": "`DefaultCategoryOrder()` returns govern, identify, protect, detect, respond, recover" },
        { "description": "`GetCategoryOrder()`, `GetCategoryByID()`, `GetSLIOrderForCategory()` helper methods" },
        { "description": "Dashboard bullet charts grouped by category with NIST CSF sort order" },
        { "description": "Dashboard flexbox layout for bullet labels with auto-calculated width" },
        { "description": "Dashboard progress chart height scales dynamically based on SLI count" }
      ],
      "changed": [
        { "description": "Dashboard bullet charts grouped by category instead of methodology (RED, USE, etc.)" },
        { "description": "Threshold Matrix sorted by category (NIST CSF order) then alphabetically by SLI name" },
        { "description": "Dashboard SLI tables sorted by category (NIST CSF order)" },
        { "description": "Dashboard progress chart sorted by category then alphabetically by SLI name" },
        { "description": "Chart heights calculated explicitly from grid layout for proper sizing" }
      ],
      "fixed": [
        { "description": "Progress chart uses same data retrieval logic as bullet charts for consistency" },
        { "description": "Bullet chart labels no longer truncated for long SLI names" }
      ],
      "documentation": [
        { "description": "SLI tags documentation in docs/schema/slos.md" },
        { "description": "Threshold Matrix documentation in docs/cli/maturity-xlsx.md" },
        { "description": "v0.7.0 release notes" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-05-10",
      "highlights": [
        { "description": "BREAKING: Three-part schema taxonomy: Model, State, Plan" },
        { "description": "BREAKING: CLI restructured to match schema taxonomy" },
        { "description": "Domain-centric examples directory structure" },
        { "description": "New MaturityStateDocument type for state tracking" },
        { "description": "Consistent schema naming: prism-maturity-{model,state,plan}.schema.json" }
      ],
      "breaking": [
        { "description": "CLI: `prism maturity report` → `prism maturity model report`" },
        { "description": "CLI: `prism maturity xlsx` → `prism maturity model xlsx`" },
        { "description": "CLI: `prism dashboard` → `prism maturity plan dashboard`" },
        { "description": "CLI: `prism report` → `prism maturity plan report`" },
        { "description": "Schema files renamed: `maturity.schema.json` → `prism-maturity-model.schema.json`" },
        { "description": "Schema files renamed: `prism.schema.json` → `prism-maturity-plan.schema.json`" },
        { "description": "Examples directory restructured to domain-centric layout" },
        { "description": "Old schema embedding functions deprecated in favor of new names" }
      ],
      "added": [
        { "description": "`prism maturity model` subcommand: report, xlsx, dashboard, validate" },
        { "description": "`prism maturity state` subcommand: validate, show" },
        { "description": "`prism maturity plan` subcommand: dashboard, report" },
        { "description": "`prism maturity model dashboard` with --state flag for state document integration" },
        { "description": "`prism maturity model validate` for model document validation" },
        { "description": "`prism maturity state validate` with --model flag for cross-validation" },
        { "description": "`prism maturity state show` with text/json output formats" },
        { "description": "`prism maturity model lint` command for identifying dashboard display issues and threshold gaps" },
        { "description": "Dashboard qualitative threshold display showing 'Tracked' for `exists` operator" },
        { "description": "Dashboard qualitative state in SLI subtitles (e.g., 'Measured (M1)', 'Tracked (M1)')" },
        { "description": "Dashboard 'Not Tracked' display for qualitative SLIs without state data" },
        { "description": "Dashboard '-' display for maturity levels without defined thresholds" },
        { "description": "Security methodology groupings: Prevention, Detection, Response" },
        { "description": "AI security methodology groupings: AI Prevention, AI Detection, AI Response" },
        { "description": "New `prism-maturity-state.schema.json` for state tracking documents" },
        { "description": "`MaturityStateDocument` type for PRISM Maturity State documents" },
        { "description": "`MaturityStateMetadata` type with maturityModelRef field" },
        { "description": "`MaturityModelSchemaJSON()`, `MaturityStateSchemaJSON()`, `MaturityPlanSchemaJSON()` functions" },
        { "description": "Schema constants: `MaturityModelSchemaID`, `MaturityStateSchemaID`, `MaturityPlanSchemaID`" },
        { "description": "Domain directories: `examples/operations/`, `examples/security/`, `examples/organization/`, `examples/quality/`" },
        { "description": "`schema/generate_state.go` for state schema generation" }
      ],
      "fixed": [
        { "description": "Dashboard threshold display for models without sliType (flat bullet list now includes thresholds)" }
      ],
      "changed": [
        { "description": "Examples organized by domain instead of by document type" },
        { "description": "All example files updated with new schema references" },
        { "description": "Test file paths updated for new examples structure" }
      ],
      "deprecated": [
        { "description": "`PRISMSchemaJSON()` - use `MaturityPlanSchemaJSON()` instead" },
        { "description": "`PRISMSchemaMap()` - use `MaturityPlanSchemaMap()` instead" },
        { "description": "`SchemaID()` - use `MaturityPlanSchemaID` instead" }
      ],
      "documentation": [
        { "description": "Updated README with three-schema taxonomy" },
        { "description": "Updated examples/README.md with domain-centric structure" },
        { "description": "Migration guide for v0.5.0 → v0.6.0" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-05-10",
      "highlights": [
        { "description": "BREAKING: Separated PRISM Maturity Model (definition) from PRISM Maturity State (tracking)" },
        { "description": "New temporal SLO window support: 7d, 30d, 90d, quarterly, annual" },
        { "description": "Hybrid qualitative/quantitative criteria with measurement type classification" },
        { "description": "Dashboard dual-read support for backward compatibility during migration" }
      ],
      "breaking": [
        { "description": "Removed `assessments` field from maturity model files - state tracking now uses separate PRISM Maturity State documents" },
        { "description": "`Spec.Assessments` field is deprecated and will be removed in a future release" },
        { "description": "`DomainAssessment` type is deprecated in favor of the new PRISM Maturity State format" },
        { "description": "Example maturity model files (`examples/maturity-models/*/model.json`) no longer contain assessment data" }
      ],
      "added": [
        { "description": "`QualitativeState` type for qualitative progression tracking (none, adhoc, tracked, measured, alerting, optimized)" },
        { "description": "`MeasurementType` constants: quantitative, qualitative, hybrid" },
        { "description": "`SLI.MeasurementType` and `SLI.QualitativeStates` fields for hybrid metric support" },
        { "description": "`SLI.GetMeasurementType()`, `GetQualitativeStates()`, `IsQuantitative()`, `IsQualitative()`, `IsHybrid()` helper methods" },
        { "description": "`Generator.WithStateDocument()` method for dashboard dual-read support" },
        { "description": "New PRISM Maturity State examples in `examples/maturity-state/` directory" },
        { "description": "Temporal window support in state documents: 7d, 30d, 90d, quarterly, annual SLO tracking" }
      ],
      "changed": [
        { "description": "XLSX generator handles nil assessments gracefully (no panic when assessments not present)" },
        { "description": "Dashboard generator supports reading state from separate PRISM Maturity State document" }
      ],
      "documentation": [
        { "description": "`docs/design/REFACTOR_MATURITY_STATE.md` with architecture for model/state separation" },
        { "description": "Updated `examples/README.md` with new directory structure and naming conventions" },
        { "description": "Migration guide for upgrading from v0.4.0 to v0.5.0" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-05-09",
      "highlights": [
        { "description": "SLI (Service Level Indicator) type for defining metrics with framework mappings once" },
        { "description": "SLI Catalog in Markdown reports showing metrics grouped by category" },
        { "description": "Expanded framework support: NIST CSF 2.0, FedRAMP baselines, SOC 2, ISO 27001, CIS Controls" },
        { "description": "TypeScript/Zod schema for web viewer component" },
        { "description": "Formal PRD documentation with project vision and design decisions" }
      ],
      "added": [
        { "description": "SLI type with framework mappings defined at metric level", "commit": "c8e72b5" },
        { "description": "SLI Catalog section in Markdown reports grouped by category", "commit": "b277766" },
        { "description": "Criterion.GetSLI(), GetFrameworkMappings(), GetMetricName() resolver methods", "commit": "c8e72b5" },
        { "description": "`prism maturity report` command for Markdown generation", "commit": "b277766" },
        { "description": "`prism maturity xlsx` command for Excel export", "commit": "dbce1ba" },
        { "description": "TypeScript/Zod schema for maturity specifications", "commit": "f251ed8" },
        { "description": "fileutil.ReplaceExtension() utility function", "commit": "19d395e" },
        { "description": "NIST CSF 2.0, NIST RMF, NIST AI RMF, NIST 800-171 framework constants", "commit": "531b527" },
        { "description": "FedRAMP High/Moderate/Low baseline constants", "commit": "531b527" },
        { "description": "CIS Controls, SOC 2, ISO 27001 framework constants", "commit": "531b527" },
        { "description": "FormatFrameworkName() helper for human-readable framework names", "commit": "531b527" }
      ],
      "changed": [
        { "description": "Criterion now references SLI via sliId field for framework mappings", "commit": "c8e72b5" },
        { "description": "Layer and Category removed from Criterion (now SLI-only)", "commit": "c8e72b5" },
        { "description": "KPIThresholds marked as deprecated in favor of SLIs", "commit": "c8e72b5" },
        { "description": "XLSX export uses SLI resolver methods for framework columns", "commit": "dbce1ba" }
      ],
      "documentation": [
        { "description": "docs/design/core/PRD.md with project vision, design decisions, ISO 25010 alignment", "commit": "9a937cc" },
        { "description": "SLI vs SLO architecture explanation in schema/slos.md", "commit": "eb89fe2" },
        { "description": "SLI Catalog section documented in cli/maturity-report.md", "commit": "eb89fe2" },
        { "description": "Framework mappings documentation updated for SLI-level mappings", "commit": "eb89fe2" },
        { "description": "README updated with maturity commands and expanded framework table", "commit": "f84eea5" },
        { "description": "IDEATION_CHAT.md converted to formal documentation", "commit": "9a937cc" }
      ],
      "tests": [
        { "description": "SLI Catalog generation tests", "commit": "b277766" },
        { "description": "SLI resolution and nil safety tests for XLSX export", "commit": "dbce1ba" },
        { "description": "Cross-platform stdout capture tests using oscompat/testutil", "commit": "91f6b94" }
      ],
      "fixed": [
        { "description": "Test hangs on Windows fixed with oscompat/testutil.CaptureStdout", "commit": "91f6b94" }
      ],
      "infrastructure": [
        { "description": "Regenerated maturity JSON schema with SLI type", "commit": "12f866a" },
        { "description": "Updated dependencies: oscompat v0.3.0, buger/jsonparser v1.2.0", "commit": "a409f27" },
        { "description": ".gitignore updated for node_modules and dist directories", "commit": "f251ed8" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-04-26",
      "highlights": [
        { "description": "Extended value stream layers: requirements, code, infra, runtime, adoption, support" },
        { "description": "Quality domain with ISO 25010-aligned metrics" },
        { "description": "Team Topologies support with stream-aligned, platform, enabling, and overlay teams" },
        { "description": "Analysis package for gap detection and initiative recommendations" },
        { "description": "Export to structured-plan formats (OKR, V2MOM, Roadmap)" },
        { "description": "Developer documentation for open source contributors" }
      ],
      "added": [
        { "description": "Quality domain constant for code quality and testing metrics", "commit": "c64f926" },
        { "description": "Extended Layer constants: requirements, code, infra, runtime, adoption, support", "commit": "3755373" },
        { "description": "Layer type with ID, name, description, and owner", "commit": "c64f926" },
        { "description": "Team type with Team Topologies patterns (stream_aligned, platform, enabling, overlay)", "commit": "c64f926" },
        { "description": "Service type with tier, owner team, layer, and metric associations", "commit": "c64f926" },
        { "description": "analysis/ package with Analyze() for comprehensive document analysis", "commit": "d2c8d4f" },
        { "description": "Gap detection: maturity gaps, SLO gaps, coverage gaps, initiative gaps", "commit": "d2c8d4f" },
        { "description": "Recommendation engine for initiative suggestions", "commit": "d2c8d4f" },
        { "description": "export/ package for structured-plan format conversion", "commit": "88ca9f7" },
        { "description": "ConvertToOKR() exports goals as OKR objectives with SLO key results", "commit": "88ca9f7" },
        { "description": "ConvertToV2MOM() exports to Salesforce V2MOM format", "commit": "88ca9f7" },
        { "description": "ConvertToRoadmap() exports phases as roadmap with deliverables", "commit": "88ca9f7" },
        { "description": "maturity/ package for standalone maturity model specs", "commit": "679fe10" },
        { "description": "Spec type with multi-domain maturity models and KPI thresholds", "commit": "679fe10" },
        { "description": "Criterion and Enabler types for level requirements and tasks", "commit": "679fe10" },
        { "description": "XLSX export for maturity model spreadsheets", "commit": "679fe10" },
        { "description": "Marp export for maturity model presentations", "commit": "679fe10" },
        { "description": "output/ package with multi-format Formatter", "commit": "3c1a425" },
        { "description": "TOON format (Token-Optimized Object Notation) for LLM efficiency", "commit": "3c1a425" },
        { "description": "TableData and DetailData types for structured output", "commit": "3c1a425" },
        { "description": "scaffold/ package for document templates", "commit": "2da8bcc" },
        { "description": "NewDocument() creates documents with specified domains", "commit": "2da8bcc" },
        { "description": "OperationsMetrics() and SecurityMetrics() example generators", "commit": "2da8bcc" },
        { "description": "`prism layer list` and `prism layer show` commands", "commit": "325d697" },
        { "description": "`prism team list` and `prism team show` commands", "commit": "325d697" },
        { "description": "`prism service list` and `prism service show` commands", "commit": "325d697" },
        { "description": "`prism analyze` command with gap detection and LLM prompt generation", "commit": "79b05da" },
        { "description": "`prism export okr` command for OKR document export", "commit": "79b05da" },
        { "description": "`prism export v2mom` command for V2MOM document export", "commit": "79b05da" },
        { "description": "`prism export roadmap` command for roadmap document export", "commit": "79b05da" },
        { "description": "`prism initiative list` and `prism initiative show` commands", "commit": "79b05da" },
        { "description": "`prism format` command for document reformatting", "commit": "79b05da" }
      ],
      "changed": [
        { "description": "PRISMDocument extended with Layers, Teams, Services arrays", "commit": "c64f926" },
        { "description": "Metric type extended with layerId and serviceId references", "commit": "3755373" },
        { "description": "Score calculation updated to handle sparse data gracefully", "commit": "3755373" },
        { "description": "JSON Schema regenerated with new types", "commit": "a4e4331" }
      ],
      "documentation": [
        { "description": "Developer guide with architecture and contributing docs", "commit": "16224e2" },
        { "description": "Concepts section with layers, teams, services, and organizational model", "commit": "865a675" },
        { "description": "Operations management documentation with golden signals", "commit": "5697da5" },
        { "description": "CLI reference for all new commands", "commit": "a16a5e2" },
        { "description": "Design docs reorganized into docs/design/maturity/ directory", "commit": "1cff605" },
        { "description": "Structured-plan integration documentation", "commit": "a16a5e2" },
        { "description": "Maturity strategies and project scoring concepts", "commit": "a16a5e2" }
      ],
      "tests": [
        { "description": "CLI tests for layer, team, service commands", "commit": "24949a8" },
        { "description": "Score calculation tests with sparse data", "commit": "24949a8" },
        { "description": "Analysis package unit tests", "commit": "d2c8d4f" },
        { "description": "Export package unit tests for OKR, V2MOM, Roadmap", "commit": "88ca9f7" },
        { "description": "CLI integration tests", "commit": "24949a8" }
      ],
      "infrastructure": [
        { "description": "Updated dependencies: echartify v0.2.0, structured-plan v0.10.0, dashforge v0.2.0, omniframe v0.1.0", "commit": "9aeceb2" },
        { "description": "Example maturity models for operations, security, product, AI domains", "commit": "ebf6c8d" },
        { "description": "Updated .gitignore for planning docs and generated files", "commit": "92483b6" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-04-18",
      "highlights": [
        { "description": "Goal-driven maturity roadmap with SLO-backed maturity levels" },
        { "description": "Phase-based planning with quarters, swimlanes, and initiative tracking" },
        { "description": "New CLI commands: goal, phase, roadmap, slo-report, dashboard" },
        { "description": "Dashforge integration for dashboard generation" }
      ],
      "added": [
        { "description": "Goal type with owner, priority, status, and maturity tracking", "commit": "e7227ec" },
        { "description": "GoalMaturityModel with 5-level progression and SLO requirements", "commit": "e7227ec" },
        { "description": "MetricCriterion for maturity level value requirements", "commit": "e7227ec" },
        { "description": "Goal.CurrentMaturityLevel() calculates achieved level from metrics", "commit": "e7227ec" },
        { "description": "Phase type for time-bounded planning periods (quarters)", "commit": "7791d4a" },
        { "description": "PhaseGoalTarget for enter/exit maturity levels per goal", "commit": "7791d4a" },
        { "description": "Swimlane for organizing initiatives by domain", "commit": "7791d4a" },
        { "description": "PhaseMetrics for tracking progress at phase boundaries", "commit": "188ef6a" },
        { "description": "GoalProgress with initiative completion and SLO compliance", "commit": "188ef6a" },
        { "description": "CalculateGoalProgress(), CalculateInitiativeMetrics(), CalculateSLOCompliance()", "commit": "188ef6a" },
        { "description": "RoadmapProgress for aggregated roadmap status", "commit": "ba66725" },
        { "description": "GetRoadmapProgress() generates full progress view", "commit": "ba66725" },
        { "description": "SLOReport with compliance rate and metric status breakdown", "commit": "0dc9981" },
        { "description": "GenerateSLOReport() creates SLO compliance reports", "commit": "0dc9981" },
        { "description": "ExecDashboard for high-level status views", "commit": "4ab2a18" },
        { "description": "Markdown report generation for executive summaries", "commit": "4ab2a18" },
        { "description": "Dashforge converter for PRISM to dashforge format", "commit": "b6ead0d" },
        { "description": "Widget generators for metrics, goals, and phases", "commit": "b6ead0d" },
        { "description": "`prism dashboard` command for executive dashboards", "commit": "eddcc38" },
        { "description": "`prism dashforge` command for dashforge conversion", "commit": "eddcc38" },
        { "description": "`prism report` command for markdown reports", "commit": "eddcc38" },
        { "description": "`prism slo-report` command for SLO compliance reports", "commit": "eddcc38" },
        { "description": "Initiative type with deployment tracking and customer adoption", "commit": "9d1ac8a" },
        { "description": "Validation for goal, phase, and initiative references", "commit": "9d1ac8a" }
      ],
      "changed": [
        { "description": "Refactored to extensible framework architecture with operations examples", "commit": "2233fde" },
        { "description": "PRISMDocument extended with Goals, Phases, Initiatives arrays", "commit": "9d1ac8a" },
        { "description": "JSON Schema updated with goal, phase, and initiative types", "commit": "9d1ac8a" }
      ],
      "documentation": [
        { "description": "Roadmap CLI documentation (goal, phase, roadmap commands)", "commit": "d59af6d" },
        { "description": "Design notes for FEAT_MATURITYROADMAP implementation", "commit": "c6998d8" },
        { "description": "Updated examples with operations-focused goal roadmap", "commit": "2233fde" }
      ],
      "tests": [
        { "description": "Unit tests for Goal, GoalMaturityModel, CurrentMaturityLevel()", "commit": "e7227ec" },
        { "description": "Unit tests for Phase, PhaseGoalTarget, Swimlane", "commit": "7791d4a" },
        { "description": "Unit tests for PhaseMetrics calculations", "commit": "188ef6a" },
        { "description": "Integration tests for SLO report generation", "commit": "0dc9981" }
      ],
      "infrastructure": [
        { "description": "Multi-agent orchestration specs for roadmap generation", "commit": "b382395" },
        { "description": "Example executive dashboard configuration", "commit": "38b63f4" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-03-30",
      "highlights": [
        { "description": "PRISM (Proactive Reliability & Security Maturity Model) - a unified framework for B2B SaaS health metrics combining SLOs, DMAIC, OKRs, and maturity modeling" },
        { "description": "CLI tool for creating, validating, and scoring PRISM documents" },
        { "description": "Auto-generated JSON Schema from Go types for editor validation" }
      ],
      "added": [
        { "description": "Core types: PRISMDocument, Metric, SLI, SLO, Thresholds, DataPoint", "commit": "7de3f42" },
        { "description": "Domain constants: security, operations", "commit": "7de3f42" },
        { "description": "Lifecycle stage constants: design, build, test, runtime, response", "commit": "7de3f42" },
        { "description": "Category constants: prevention, detection, response, reliability, efficiency, quality", "commit": "7de3f42" },
        { "description": "Metric types: coverage, rate, latency, ratio, count, distribution, score", "commit": "7de3f42" },
        { "description": "Framework mapping support: NIST_CSF, MITRE_ATTACK, DORA, SRE", "commit": "7de3f42" },
        { "description": "Validation functions for all constants and document structure", "commit": "34d96a5" },
        { "description": "ValidationError and ValidationErrors types for detailed error reporting", "commit": "34d96a5" },
        { "description": "5-level maturity model: Reactive, Basic, Defined, Managed, Optimizing", "commit": "ba48494" },
        { "description": "MaturityModel, MaturityLevelDef, MaturityCell types", "commit": "ba48494" },
        { "description": "NewMaturityModelForDomains() for domain-filtered initialization", "commit": "ba48494" },
        { "description": "Customer awareness model with four states: unaware, aware_not_remediating, aware_remediating, aware_remediated", "commit": "fd558e9" },
        { "description": "AwarenessScore() using mutually exclusive state weights (0.0 → 0.25 → 0.5 → 1.0)", "commit": "fd558e9" },
        { "description": "PRISM score calculation combining maturity and performance", "commit": "01b86c6" },
        { "description": "Configurable weights: maturity 40%, performance 60%, stage weights, domain weights", "commit": "01b86c6" },
        { "description": "Score interpretation: Elite (≥0.9), Strong (≥0.75), Medium (≥0.5), Weak (≥0.25), Critical", "commit": "01b86c6" },
        { "description": "SLO.Operator and SLO.Value fields for machine-evaluable targets", "commit": "7de3f42" },
        { "description": "Metric.MeetsSLO() method for programmatic SLO checking", "commit": "7de3f42" },
        { "description": "Metric.CalculateStatus() for threshold-based status calculation", "commit": "7de3f42" },
        { "description": "Metric.ProgressToTarget() for progress tracking", "commit": "7de3f42" },
        { "description": "`prism init` command with domain filtering (-d) and output path (-o)", "commit": "b3d3352" },
        { "description": "`prism validate` command for document validation", "commit": "b3d3352" },
        { "description": "`prism score` command with --detailed and --json flags", "commit": "b3d3352" },
        { "description": "`prism catalog` command to list available constants", "commit": "b3d3352" },
        { "description": "JSON Schema auto-generation from Go types using invopop/jsonschema", "commit": "693290b" },
        { "description": "Embedded schema access via schema.PRISMSchemaJSON()", "commit": "693290b" }
      ],
      "documentation": [
        { "description": "README with installation, CLI usage, schema overview, and examples", "commit": "8cda40b" },
        { "description": "Example metrics for operations domain", "commit": "28224c2" },
        { "description": "Operations metrics example (8 DORA-aligned metrics: availability, latency, error rate, deployment frequency, lead time, MTTR, change failure rate, IaC coverage)", "commit": "28224c2" },
        { "description": "Score weight normalization behavior documented in ScoreConfig", "commit": "01b86c6" }
      ],
      "tests": [
        { "description": "Unit tests for validation, maturity, awareness, and scoring", "commit": "4590a5b" },
        { "description": "Integration tests for example JSON files", "commit": "4590a5b" },
        { "description": "DataPoint timestamp JSON round-trip tests", "commit": "4590a5b" },
        { "description": "MeetsSLO() tests for all operators (gte, lte, gt, lt, eq)", "commit": "4590a5b" }
      ],
      "dependencies": [
        { "description": "github.com/spf13/cobra v1.10.2 for CLI", "commit": "e5a4109" },
        { "description": "github.com/invopop/jsonschema v0.13.0 for schema generation", "commit": "e5a4109" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions workflows for CI, linting, and CodeQL", "commit": "e5a4109" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "e5a4109" },
        { "description": "golangci-lint configuration", "commit": "e5a4109" }
      ]
    }
  ]
}
